back/app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos"
---
  def index
    #@todos = Todo.all
    @todos = Todo.all.sort_by { |a| a.done ? 1 : 0 }

INSERT INTO "todos" ("label", "created_at", "updated_at") VALUES (?, ?, ?)  [["label", "Test to add"], ["created_at", "2018-11-13 17:36:40.102651"], ["updated_at", "2018-11-13 17:36:40.102651"]]
---
  def create
    @todo = Todo.new(todo_params)

    if @todo.save

UPDATE "todos" SET "done" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["done", 1], ["updated_at", "2018-11-13 17:48:39.305054"], ["id", 3]]
---
  def update
    if @todo.update(todo_params)